#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/th3pl4gu3-prod/github-api-workspace/runs/run-xn9sH2Yt8Cs56qS9

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_budgets_budget.monthly-limit-budget will be created
  + resource "aws_budgets_budget" "monthly-limit-budget" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + cost_filters      = (known after apply)
      + id                = (known after apply)
      + limit_amount      = "5"
      + limit_unit        = "USD"
      + name              = "monthly-limit-budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2080-01-01_00:00"
      + time_period_start = "2022-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = (known after apply)
          + values = (known after apply)
        }

      + cost_types {
          + include_credit             = (known after apply)
          + include_discount           = (known after apply)
          + include_other_subscription = (known after apply)
          + include_recurring          = (known after apply)
          + include_refund             = (known after apply)
          + include_subscription       = (known after apply)
          + include_support            = (known after apply)
          + include_tax                = (known after apply)
          + include_upfront            = (known after apply)
          + use_amortized              = (known after apply)
          + use_blended                = (known after apply)
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "mervinhemaraju16@gmail.com",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "FORECASTED"
          + subscriber_email_addresses = [
              + "mervinhemaraju16@gmail.com",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 90
          + threshold_type             = "PERCENTAGE"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @mervinhemaraju, Action: `pull_request`*